sample/all/swarm-sn-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-client1-t4-c512-d30-R4000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=4000
Running 30s test @ http://10.10.1.5:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 194.940ms, rate sampling interval: 1650ms
  Thread calibration: mean lat.: 219.071ms, rate sampling interval: 1738ms
  Thread calibration: mean lat.: 183.380ms, rate sampling interval: 1496ms
  Thread calibration: mean lat.: 170.550ms, rate sampling interval: 1295ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.61s     4.57s   17.71s    79.37%
    Req/Sec   568.92     62.58   712.00     68.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.70s 
 75.000%    7.99s 
 90.000%   11.13s 
 99.000%   17.71s 
 99.900%   19.86s 
 99.990%   20.17s 
 99.999%   21.71s 
100.000%   21.71s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.772     0.000000            1         1.00
     148.351     0.100000         4573         1.11
     475.903     0.200000         9147         1.25
     992.767     0.300000        13719         1.43
    1762.303     0.400000        18290         1.67
    2697.215     0.500000        22862         2.00
    3434.495     0.550000        25152         2.22
    4763.647     0.600000        27441         2.50
    6148.095     0.650000        29728         2.86
    7184.383     0.700000        32010         3.33
    7987.199     0.750000        34300         4.00
    8380.415     0.775000        35444         4.44
    8790.015     0.800000        36581         5.00
    9281.535     0.825000        37729         5.71
    9854.975     0.850000        38865         6.67
   10502.143     0.875000        40010         8.00
   10813.439     0.887500        40586         8.89
   11132.927     0.900000        41162        10.00
   11444.223     0.912500        41732        11.43
   11853.823     0.925000        42296        13.33
   12451.839     0.937500        42866        16.00
   12795.903     0.943750        43151        17.78
   13271.039     0.950000        43436        20.00
   13754.367     0.956250        43726        22.86
   14442.495     0.962500        44008        26.67
   15294.463     0.968750        44296        32.00
   15515.647     0.971875        44437        35.56
   15843.327     0.975000        44579        40.00
   16105.471     0.978125        44722        45.71
   16433.151     0.981250        44865        53.33
   16842.751     0.984375        45010        64.00
   17088.511     0.985938        45081        71.11
   17317.887     0.987500        45151        80.00
   17547.263     0.989062        45226        91.43
   17842.175     0.990625        45299       106.67
   18038.783     0.992188        45365       128.00
   18137.087     0.992969        45402       142.22
   18235.391     0.993750        45437       160.00
   18481.151     0.994531        45475       182.86
   18661.375     0.995313        45508       213.33
   19005.439     0.996094        45549       256.00
   19120.127     0.996484        45567       284.44
   19202.047     0.996875        45580       320.00
   19415.039     0.997266        45597       365.71
   19578.879     0.997656        45616       426.67
   19660.799     0.998047        45633       512.00
   19709.951     0.998242        45645       568.89
   19726.335     0.998437        45651       640.00
   19808.255     0.998633        45665       731.43
   19824.639     0.998828        45672       853.33
   19873.791     0.999023        45678      1024.00
   19890.175     0.999121        45683      1137.78
   19939.327     0.999219        45689      1280.00
   19955.711     0.999316        45691      1462.86
   19988.479     0.999414        45696      1706.67
   20021.247     0.999512        45700      2048.00
   20054.015     0.999561        45707      2275.56
   20054.015     0.999609        45707      2560.00
   20054.015     0.999658        45707      2925.71
   20070.399     0.999707        45709      3413.33
   20086.783     0.999756        45712      4096.00
   20086.783     0.999780        45712      4551.11
   20135.935     0.999805        45716      5120.00
   20135.935     0.999829        45716      5851.43
   20135.935     0.999854        45716      6826.67
   20168.703     0.999878        45718      8192.00
   20168.703     0.999890        45718      9102.22
   20168.703     0.999902        45718     10240.00
   20201.471     0.999915        45719     11702.86
   20201.471     0.999927        45719     13653.33
   20774.911     0.999939        45720     16384.00
   20774.911     0.999945        45720     18204.44
   20774.911     0.999951        45720     20480.00
   21610.495     0.999957        45721     23405.71
   21610.495     0.999963        45721     27306.67
   21610.495     0.999969        45721     32768.00
   21610.495     0.999973        45721     36408.89
   21610.495     0.999976        45721     40960.00
   21708.799     0.999979        45722     46811.43
   21708.799     1.000000        45722          inf
#[Mean    =     4610.845, StdDeviation   =     4569.793]
#[Max     =    21692.416, Total count    =        45722]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  78360 requests in 30.00s, 720.02MB read
  Non-2xx or 3xx responses: 427
Requests/sec:   2611.90
Transfer/sec:     24.00MB