sample/all/swarm-sn-wrk-mixed-c6525-25g-exp14-havail0-hori0-verti1-infi1-client1-t4-c512-d30-R1500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=1500
Running 30s test @ http://10.10.1.8:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 2.558ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.578ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.538ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.527ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.66ms    1.33ms   5.52ms   61.93%
    Req/Sec   393.24    204.46     1.00k    70.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.47ms
 75.000%    3.83ms
 90.000%    4.42ms
 99.000%    5.52ms
 99.900%    6.88ms
 99.990%    7.62ms
 99.999%   26.13ms
100.000%   26.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.425     0.000000            1         1.00
       1.038     0.100000         2967         1.11
       1.363     0.200000         5945         1.25
       1.586     0.300000         8905         1.43
       1.987     0.400000        11869         1.67
       2.471     0.500000        14838         2.00
       2.719     0.550000        16325         2.22
       3.081     0.600000        17810         2.50
       3.415     0.650000        19288         2.86
       3.637     0.700000        20769         3.33
       3.825     0.750000        22266         4.00
       3.913     0.775000        22998         4.44
       4.001     0.800000        23736         5.00
       4.091     0.825000        24479         5.71
       4.195     0.850000        25249         6.67
       4.299     0.875000        25980         8.00
       4.359     0.887500        26333         8.89
       4.419     0.900000        26717        10.00
       4.483     0.912500        27076        11.43
       4.555     0.925000        27461        13.33
       4.635     0.937500        27817        16.00
       4.683     0.943750        28010        17.78
       4.747     0.950000        28187        20.00
       4.807     0.956250        28371        22.86
       4.879     0.962500        28566        26.67
       4.967     0.968750        28747        32.00
       5.015     0.971875        28836        35.56
       5.075     0.975000        28932        40.00
       5.131     0.978125        29029        45.71
       5.207     0.981250        29116        53.33
       5.307     0.984375        29209        64.00
       5.363     0.985938        29254        71.11
       5.427     0.987500        29301        80.00
       5.487     0.989062        29345        91.43
       5.567     0.990625        29392       106.67
       5.655     0.992188        29438       128.00
       5.711     0.992969        29463       142.22
       5.763     0.993750        29485       160.00
       5.835     0.994531        29508       182.86
       5.903     0.995313        29530       213.33
       6.011     0.996094        29554       256.00
       6.091     0.996484        29565       284.44
       6.147     0.996875        29577       320.00
       6.223     0.997266        29588       365.71
       6.395     0.997656        29600       426.67
       6.547     0.998047        29612       512.00
       6.595     0.998242        29617       568.89
       6.659     0.998437        29625       640.00
       6.719     0.998633        29629       731.43
       6.855     0.998828        29635       853.33
       6.895     0.999023        29641      1024.00
       6.915     0.999121        29643      1137.78
       6.939     0.999219        29646      1280.00
       7.075     0.999316        29649      1462.86
       7.119     0.999414        29652      1706.67
       7.151     0.999512        29655      2048.00
       7.191     0.999561        29656      2275.56
       7.223     0.999609        29658      2560.00
       7.283     0.999658        29659      2925.71
       7.391     0.999707        29661      3413.33
       7.407     0.999756        29662      4096.00
       7.443     0.999780        29663      4551.11
       7.479     0.999805        29664      5120.00
       7.479     0.999829        29664      5851.43
       7.555     0.999854        29665      6826.67
       7.623     0.999878        29666      8192.00
       7.623     0.999890        29666      9102.22
       8.087     0.999902        29667     10240.00
       8.087     0.999915        29667     11702.86
       8.087     0.999927        29667     13653.33
       8.223     0.999939        29668     16384.00
       8.223     0.999945        29668     18204.44
       8.223     0.999951        29668     20480.00
       8.223     0.999957        29668     23405.71
       8.223     0.999963        29668     27306.67
      26.127     0.999969        29669     32768.00
      26.127     1.000000        29669          inf
#[Mean    =        2.657, StdDeviation   =        1.333]
#[Max     =       26.112, Total count    =        29669]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44704 requests in 30.00s, 232.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
  Non-2xx or 3xx responses: 6293
Requests/sec:   1490.07
Transfer/sec:      7.75MB